blog/2019/02/13/使用shell构建多进程的commandlinefu爬虫/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>使用shell构建多进程的commandlinefu爬虫 - 暗无天日</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
  <meta name="author" content="lujun9972" />
  <meta name="keywords" content="linux和它的小伙伴" />
  <link rel="stylesheet" media="screen" href="/media/css/font.css" rel="stylesheet" type="text/css"/>
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/kdComment.css" type="text/css">
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="/">暗无天日</a></h1>
    <p>=============&gt;随便,谢谢</p>
    <nav class="site-nav">
      <div class="menu-icon">
      </div>
      <ul class="trigger">
              <li><a href="/years/">Years</a></li>
              <li><a href="/authors/">Authors</a></li>
              <li><a href="/tags/">Tags</a></li>
              <li><a href="/about/">About</a></li>
              <li><a href="https://github.com/lujun9972/lujun9972.github.com">Github</a></li>
              <li><a href="/rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
        <input type="text" class="field" name="q" id="s" placeholder="Search">
        <input type="hidden" name="as_sitesearch" value="lujun9972.github.io">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">使用shell构建多进程的commandlinefu爬虫</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1d13a0c">参数定义</a></li>
<li><a href="#org4913238">解析命令浏览页面</a>
<ul>
<li><a href="#org66a95f4">实现进程之间的通讯队列</a></li>
<li><a href="#org800bd97">从页面中抽取想要的信息</a></li>
<li><a href="#org37c092e">循环读取下一页的浏览页面，不断抽取代码片段URL写入队列</a></li>
</ul>
</li>
<li><a href="#org72b7265">解析脚本片段页面</a></li>
<li><a href="#org6919947">组合起来</a></li>
<li><a href="#orge7550bf">抓取其他网站</a></li>
</ul>
</div>
</div>
<p>
<a href="https://www.commandlinefu.com">commandlinefu</a>是一个记录脚本片段的网站,每个片段都有对应的功能说明和对应的标签。我想要做的就是尝试用shell写一个多进程的爬虫把这些代码片段记录在一个org文件中。
</p>

<div id="outline-container-org1d13a0c" class="outline-2">
<h2 id="org1d13a0c">参数定义</h2>
<div class="outline-text-2" id="text-org1d13a0c">
<p>
这个脚本需要能够通过 <code>-n</code> 参数指定并发的爬虫数(默认为CPU核的数量)，还要能通过 <code>-f</code> 指定保存的org文件路径(默认输出到stdout)。
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/usr/bin/</span><span style="color: #4f97d7; font-weight: bold;">env</span><span style="color: #2aa1ae; background-color: #292e34;"> bash</span>

<span style="color: #7590db;">proc_num</span>=$<span style="color: #4f97d7;">(</span><span style="color: #fa8072;">nproc</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">store_file</span>=/dev/stdout
<span style="color: #4f97d7; font-weight: bold;">while </span><span style="color: #4f97d7;">getopts</span> :n:f: OPT; <span style="color: #4f97d7; font-weight: bold;">do</span>
    <span style="color: #4f97d7; font-weight: bold;">case</span> $<span style="color: #7590db;">OPT</span><span style="color: #4f97d7; font-weight: bold;"> in</span>
        n|+n)
            <span style="color: #7590db;">proc_num</span>=<span style="color: #2d9574;">"$OPTARG"</span>
            ;;
        f|+f)
            <span style="color: #7590db;">store_file</span>=<span style="color: #2d9574;">"$OPTARG"</span>
            ;;
        *)
            <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"usage: ${0##*/} [+-n proc_num] [+-f org_file} [--]"</span>
            <span style="color: #4f97d7; font-weight: bold;">exit</span> <span style="color: #a45bad;">2</span>
    <span style="color: #4f97d7; font-weight: bold;">esac</span>
<span style="color: #4f97d7; font-weight: bold;">done</span>
<span style="color: #4f97d7;">shift</span> $<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span> OPTIND - <span style="color: #a45bad;">1</span> <span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">OPTIND</span>=<span style="color: #a45bad;">1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4913238" class="outline-2">
<h2 id="org4913238">解析命令浏览页面</h2>
<div class="outline-text-2" id="text-org4913238">
<p>
我们需要一个进程从commandlinefu的浏览列表中抽取各个脚本片段的URL，这个进程将抽取出来的URL存放到一个队列中，再由各个爬虫进程从进程中读取URL并从中抽取出对应的代码片段、描述说明和标签信息写入org文件中。
</p>

<p>
这里就会遇到三个问题: 
</p>
<ol class="org-ol">
<li>进程之间通讯的队列如何实现</li>
<li>如何从页面中抽取出URL、代码片段、描述说明、标签等信息</li>
<li>多进程对同一文件进行读写时的乱序问题</li>
</ol>
</div>

<div id="outline-container-org66a95f4" class="outline-3">
<h3 id="org66a95f4">实现进程之间的通讯队列</h3>
<div class="outline-text-3" id="text-org66a95f4">
<p>
这个问题比较好解决，我们可以通过一个命名管道来实现
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #7590db;">queue</span>=$<span style="color: #4f97d7;">(</span><span style="color: #fa8072;">mktemp</span> --dry-run<span style="color: #4f97d7;">)</span>
mkfifo $<span style="color: #4f97d7;">{</span><span style="color: #7590db;">queue</span><span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">exec</span> <span style="color: #a45bad;">99</span>&lt;&gt;$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">queue</span><span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">trap</span> <span style="color: #2d9574;">"rm ${queue} 2&gt;/dev/null"</span> EXIT
</pre>
</div>
</div>
</div>

<div id="outline-container-org800bd97" class="outline-3">
<h3 id="org800bd97">从页面中抽取想要的信息</h3>
<div class="outline-text-3" id="text-org800bd97">
<p>
从页面中提取元素内容主要有两种方法:
</p>
<ol class="org-ol">
<li>对于简单的HTML页面，我们可以通过 <code>sed</code>, <code>grep</code>, <code>awk</code> 等工具通过正则表达式匹配的方式来从HTML中抽取信息。</li>
<li>通过 <a href="https://www.w3.org/Tools/HTML-XML-utils/">html-xml-utils</a> 工具集中的 <a href="https://www.w3.org/Tools/HTML-XML-utils/man1/hxselect.html">hxselect</a> 来根据CSS selector提取相关元素</li>
</ol>

<p>
这里我们使用 <code>html-xml-utils</code> 工具来提取
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">extract_views_from_browse_page</span><span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">[</span> $<span style="color: #7590db;">#</span> -eq <span style="color: #a45bad;">0</span> <span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">]</span>;<span style="color: #4f97d7; font-weight: bold;">then</span>
        <span style="color: #4f97d7;">local</span> <span style="color: #7590db;">html</span>=$<span style="color: #bc6ec5;">(</span><span style="color: #fa8072;">cat</span> -<span style="color: #bc6ec5;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">else</span>
        <span style="color: #4f97d7;">local</span> <span style="color: #7590db;">html</span>=<span style="color: #2d9574;">"$*"</span>
    <span style="color: #4f97d7; font-weight: bold;">fi</span>
    <span style="color: #4f97d7;">echo</span> $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">html</span><span style="color: #bc6ec5;">}</span> |hxclean |hxselect -c -s <span style="color: #2d9574;">"\n"</span> <span style="color: #2d9574;">"li.list-group-item &gt; div:nth-child(1) &gt; div:nth-child(1) &gt; a:nth-child(1)::attr(href)"</span>|sed <span style="color: #2d9574;">'s@^@https://www.commandlinefu.com/@'</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">extract_nextpage_from_browse_page</span><span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">[</span> $<span style="color: #7590db;">#</span> -eq <span style="color: #a45bad;">0</span> <span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">]</span>;<span style="color: #4f97d7; font-weight: bold;">then</span>
        <span style="color: #4f97d7;">local</span> <span style="color: #7590db;">html</span>=$<span style="color: #bc6ec5;">(</span><span style="color: #fa8072;">cat</span> -<span style="color: #bc6ec5;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">else</span>
        <span style="color: #4f97d7;">local</span> <span style="color: #7590db;">html</span>=<span style="color: #2d9574;">"$*"</span>
    <span style="color: #4f97d7; font-weight: bold;">fi</span>
    <span style="color: #4f97d7;">echo</span> $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">html</span><span style="color: #bc6ec5;">}</span> |hxclean |hxselect -s <span style="color: #2d9574;">"\n"</span> <span style="color: #2d9574;">"li.list-group-item:nth-child(26) &gt; a"</span>|grep <span style="color: #2d9574;">'&amp;gt;'</span>|hxselect -c <span style="color: #2d9574;">"::attr(href)"</span>|sed <span style="color: #2d9574;">'s@^@https://www.commandlinefu.com/@'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
这里需要注意的是: <b>hxselect对html解析时要求遵循严格的XML规范，因此在用hxselect解析之前需要先经过hxclean矫正</b>
另外，为了防止html过大,超过参数列表长度，这里允许通过管道的形式将html内容传入
</p>
</div>
</div>
