linux和它的小伙伴/使用shell构建多进程的commandlinefu爬虫.org
** 循环读取下一页的浏览页面，不断抽取代码片段URL写入队列
这里要解决的是上面提到的第三个问题: *多进程对管道进行读写时如何保障不出现乱序?*
为此，我们需要在写入文件时对文件加锁，然后在写完文件后对文件解锁，在shell中我们可以使用 =flock= 来对文件进行枷锁。
关于flock的使用方法和注意事项，请参见另一片博文 =linux shell flock文件锁的用法及注意事项=
   
由于需要在 =flock= 子进程中使用函数 =extract_views_from_browse_page=, 因此需要先导出该函数
#+BEGIN_SRC shell :tangle "~/bin/commandlinefu_spider.bash"
  export -f extract_views_from_browse_page
#+END_SRC

由于网络问题，使用curl获取内容可能失败，需要重复获取
#+BEGIN_SRC shell :tangle "~/bin/commandlinefu_spider.bash"
  function fetch()
  {
      local url="$1"
      while ! curl -L ${url} 2>/dev/null;do
          :
      done
  }
#+END_SRC

collector用来从种子URL中抓取待爬的URL，写入管道文件中，写操作期间管道文件同时作为锁文件
#+BEGIN_SRC shell :tangle "~/bin/commandlinefu_spider.bash"
  function collector()
  {
      url="$*"
      while [[ -n ${url} ]];do
          echo "从$url中抽取"
          html=$(fetch "${url}")
          echo "${html}"|flock ${queue} -c "extract_views_from_browse_page >${queue}"
          url=$(echo "${html}"|extract_nextpage_from_browse_page)
      done
      # 让后面解析代码片段的爬虫进程能够正常退出，而不至于被阻塞.
      for ((i=0;i<${proc_num};i++))
      do
          echo >${queue}
      done
  }

#+END_SRC

这里要注意的是， *在找不到下一页URL后，我们用一个for循环往队列里写入了 =proc_num= 个空行*, 这一步的目的是让后面解析代码片段的爬虫进程能够正常退出，而不至于被阻塞.

* 解析脚本片段页面
我们需要从脚本片段的页面中抽取标题、代码片段、描述说明以及标签信息，同时将这些内容按org-mode的格式写入存储文件中.

#+BEGIN_SRC shell :tangle "~/bin/commandlinefu_spider.bash"
    function view_page_handler()
    {
        local url="$1"
        local html="$(fetch "${url}")"
        # headline
        local headline="$(echo ${html} |hxclean |hxselect -c -s "\n" ".col-md-8 > h1:nth-child(1)")"
        # command
        local command="$(echo ${html} |hxclean |hxselect -c -s "\n" ".col-md-8 > div:nth-child(2) > span:nth-child(2)"|pandoc -f html -t org)"
        # description
        local description="$(echo ${html} |hxclean |hxselect -c -s "\n" ".col-md-8 > div.description"|pandoc -f html -t org)"
        # tags
        local tags="$(echo ${html} |hxclean |hxselect -c -s ":" ".functions > a")"
        if [[ -n "${tags}" ]];then
            tags=":${tags}"
        fi
        # build org content
        cat <<EOF |flock -x ${store_file} tee -a ${store_file}
  ,* ${headline}      ${tags}

  :PROPERTIES:
  :URL:       ${url}
  :END:

  ${description}
  ,#+begin_src shell
  ${command}
  ,#+end_src

  EOF
    }
#+END_SRC
这里抽取信息的方法跟上面的类似，不过代码片段和描述说明中可能有一些HTML代码，因此通过pandoc将之转换为org格式的内容

注意最后输出org-mode的格式并写入存储文件中的代码不要写成下面这样
#+BEGIN_SRC shell
      flock -x ${store_file} cat <<EOF >${store_file}
      ,* ${headline}\t\t ${tags}
      ${description}
      ,#+begin_src shell
      ${command}
      ,#+end_src
  EOF
#+END_SRC
它的意思是使用 =flock= 对 =cat= 命令进行加锁，再把 =flock= 整个命令的结果通过重定向输出到存储文件中，而重定向输出的这个过程是没有加锁的。


spider 从管道文件中读取待抓取的URL，然后实施真正的抓取动作.
#+BEGIN_SRC shell :tangle "~/bin/commandlinefu_spider.bash"
  function spider()
  {
      while :
      do
          if ! url=$(flock ${queue} -c 'read -t 1 -u 99 url && echo $url')
          then
              sleep 1
              continue
          fi

          if [[ -z "$url" ]];then
              break
          fi
          view_page_handler ${url}
      done
  }
#+END_SRC
这里要注意的是，为了防止发生死锁，从管道中读取URL时设置了超时，当出现超时就意味着生产进程赶不上消费进程的消费速度,因此消费进程休眠一秒后再次检查队列中的URL

