blog/2019/02/13/使用shell构建多进程的commandlinefu爬虫/index.html

<div id="outline-container-org37c092e" class="outline-3">
<h3 id="org37c092e">循环读取下一页的浏览页面，不断抽取代码片段URL写入队列</h3>
<div class="outline-text-3" id="text-org37c092e">
<p>
这里要解决的是上面提到的第三个问题: <b>多进程对管道进行读写时如何保障不出现乱序?</b>
为此，我们需要在写入文件时对文件加锁，然后在写完文件后对文件解锁，在shell中我们可以使用 <code>flock</code> 来对文件进行枷锁。
关于flock的使用方法和注意事项，请参见另一片博文 <code>linux shell flock文件锁的用法及注意事项</code>
</p>

<p>
由于需要在 <code>flock</code> 子进程中使用函数 <code>extract_views_from_browse_page</code>, 因此需要先导出该函数
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">export</span> -f extract_views_from_browse_page
</pre>
</div>

<p>
由于网络问题，使用curl获取内容可能失败，需要重复获取
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">fetch</span><span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7;">local</span> <span style="color: #7590db;">url</span>=<span style="color: #2d9574;">"$1"</span>
    <span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #a45bad;">!</span> curl -L $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">url</span><span style="color: #bc6ec5;">}</span> <span style="color: #a45bad;">2</span>&gt;/dev/null;<span style="color: #4f97d7; font-weight: bold;">do</span>
        :
    <span style="color: #4f97d7; font-weight: bold;">done</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
collector用来从种子URL中抓取待爬的URL，写入管道文件中，写操作期间管道文件同时作为锁文件
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">collector</span><span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #7590db;">url</span>=<span style="color: #2d9574;">"$*"</span>
    <span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">[</span> -n $<span style="color: #67b11d;">{</span><span style="color: #7590db;">url</span><span style="color: #67b11d;">}</span> <span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">]</span>;<span style="color: #4f97d7; font-weight: bold;">do</span>
        <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"&#20174;$url&#20013;&#25277;&#21462;"</span>
        <span style="color: #7590db;">html</span>=$<span style="color: #bc6ec5;">(</span><span style="color: #fa8072;">fetch</span> <span style="color: #2d9574;">"${url}"</span><span style="color: #bc6ec5;">)</span>
        <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"${html}"</span>|flock $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">queue</span><span style="color: #bc6ec5;">}</span> -c <span style="color: #2d9574;">"extract_views_from_browse_page &gt;${queue}"</span>
        <span style="color: #7590db;">url</span>=$<span style="color: #bc6ec5;">(</span><span style="color: #fa8072;">echo</span> <span style="color: #2d9574;">"${html}"</span>|extract_nextpage_from_browse_page<span style="color: #bc6ec5;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">done</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#35753;&#21518;&#38754;&#35299;&#26512;&#20195;&#30721;&#29255;&#27573;&#30340;&#29228;&#34411;&#36827;&#31243;&#33021;&#22815;&#27491;&#24120;&#36864;&#20986;&#65292;&#32780;&#19981;&#33267;&#20110;&#34987;&#38459;&#22622;.</span>
    <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span><span style="color: #7590db;">i</span>=<span style="color: #a45bad;">0</span>;i&lt;$<span style="color: #67b11d;">{</span><span style="color: #7590db;">proc_num</span><span style="color: #67b11d;">}</span>;i++<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">do</span>
        <span style="color: #4f97d7;">echo</span> &gt;$<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">queue</span><span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">done</span>
<span style="color: #4f97d7;">}</span>

</pre>
</div>

<p>
这里要注意的是， <b>在找不到下一页URL后，我们用一个for循环往队列里写入了 <code>proc_num</code> 个空行</b>, 这一步的目的是让后面解析代码片段的爬虫进程能够正常退出，而不至于被阻塞.
</p>
</div>
</div>
</div>

<div id="outline-container-org72b7265" class="outline-2">
<h2 id="org72b7265">解析脚本片段页面</h2>
<div class="outline-text-2" id="text-org72b7265">
<p>
我们需要从脚本片段的页面中抽取标题、代码片段、描述说明以及标签信息，同时将这些内容按org-mode的格式写入存储文件中.
</p>

<div class="org-src-container">
<pre class="src src-shell">  <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">view_page_handler</span><span style="color: #4f97d7;">()</span>
  <span style="color: #4f97d7;">{</span>
      <span style="color: #4f97d7;">local</span> <span style="color: #7590db;">url</span>=<span style="color: #2d9574;">"$1"</span>
      <span style="color: #4f97d7;">local</span> <span style="color: #7590db;">html</span>=<span style="color: #2d9574;">"$(</span><span style="color: #fa8072;">fetch</span><span style="color: #2d9574;"> "${url}")"</span>
      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">headline</span>
      <span style="color: #4f97d7;">local</span> <span style="color: #7590db;">headline</span>=<span style="color: #2d9574;">"$(</span><span style="color: #fa8072;">echo</span><span style="color: #2d9574;"> ${html} |hxclean |hxselect -c -s "\n" ".col-md-8 &gt; h1:nth-child(1)")"</span>
      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">command</span>
      <span style="color: #4f97d7;">local</span> <span style="color: #7590db;">command</span>=<span style="color: #2d9574;">"$(</span><span style="color: #fa8072;">echo</span><span style="color: #2d9574;"> ${html} |hxclean |hxselect -c -s "\n" ".col-md-8 &gt; div:nth-child(2) &gt; span:nth-child(2)"|pandoc -f html -t org)"</span>
      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">description</span>
      <span style="color: #4f97d7;">local</span> <span style="color: #7590db;">description</span>=<span style="color: #2d9574;">"$(</span><span style="color: #fa8072;">echo</span><span style="color: #2d9574;"> ${html} |hxclean |hxselect -c -s "\n" ".col-md-8 &gt; div.description"|pandoc -f html -t org)"</span>
      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">tags</span>
      <span style="color: #4f97d7;">local</span> <span style="color: #7590db;">tags</span>=<span style="color: #2d9574;">"$(</span><span style="color: #fa8072;">echo</span><span style="color: #2d9574;"> ${html} |hxclean |hxselect -c -s ":" ".functions &gt; a")"</span>
      <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">[</span> -n <span style="color: #2d9574;">"${tags}"</span> <span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">]</span>;<span style="color: #4f97d7; font-weight: bold;">then</span>
          <span style="color: #7590db;">tags</span>=<span style="color: #2d9574;">":${tags}"</span>
      <span style="color: #4f97d7; font-weight: bold;">fi</span>
      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">build org content</span>
      cat &lt;&lt;EOF |flock -x $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">store_file</span><span style="color: #bc6ec5;">}</span> tee -a $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">store_file</span><span style="color: #bc6ec5;">}</span>
<span style="color: #ffff00; font-weight: bold;">* ${headline}      ${tags}</span>

<span style="color: #ffff00; font-weight: bold;">:PROPERTIES:</span>
<span style="color: #ffff00; font-weight: bold;">:URL:       ${url}</span>
<span style="color: #ffff00; font-weight: bold;">:END:</span>

<span style="color: #ffff00; font-weight: bold;">${description}</span>
<span style="color: #ffff00; font-weight: bold;">#+begin_src shell</span>
<span style="color: #ffff00; font-weight: bold;">${command}</span>
<span style="color: #ffff00; font-weight: bold;">#+end_src</span>

<span style="color: #ffff00; font-weight: bold;">EOF</span>
  <span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
这里抽取信息的方法跟上面的类似，不过代码片段和描述说明中可能有一些HTML代码，因此通过pandoc将之转换为org格式的内容
</p>

<p>
注意最后输出org-mode的格式并写入存储文件中的代码不要写成下面这样
</p>
<div class="org-src-container">
<pre class="src src-shell">    flock -x $<span style="color: #4f97d7;">{</span><span style="color: #7590db;">store_file</span><span style="color: #4f97d7;">}</span> cat &lt;&lt;EOF &gt;$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">store_file</span><span style="color: #4f97d7;">}</span>
<span style="color: #ffff00; font-weight: bold;">    * ${headline}\t\t ${tags}</span>
<span style="color: #ffff00; font-weight: bold;">    ${description}</span>
<span style="color: #ffff00; font-weight: bold;">    #+begin_src shell</span>
<span style="color: #ffff00; font-weight: bold;">    ${command}</span>
<span style="color: #ffff00; font-weight: bold;">    #+end_src</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>
</pre>
</div>
<p>
它的意思是使用 <code>flock</code> 对 <code>cat</code> 命令进行加锁，再把 <code>flock</code> 整个命令的结果通过重定向输出到存储文件中，而重定向输出的这个过程是没有加锁的。
</p>


<p>
spider 从管道文件中读取待抓取的URL，然后实施真正的抓取动作.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">spider</span><span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">while</span> :
    <span style="color: #4f97d7; font-weight: bold;">do</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #a45bad;">!</span> <span style="color: #7590db;">url</span>=$<span style="color: #bc6ec5;">(</span><span style="color: #fa8072;">flock</span> $<span style="color: #2d9574;">{</span><span style="color: #7590db;">queue</span><span style="color: #2d9574;">}</span> -c <span style="color: #2d9574;">'read -t 1 -u 99 url &amp;&amp; echo $url'</span><span style="color: #bc6ec5;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">then</span>
            sleep <span style="color: #a45bad;">1</span>
            <span style="color: #4f97d7; font-weight: bold;">continue</span>
        <span style="color: #4f97d7; font-weight: bold;">fi</span>

        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">[</span> -z <span style="color: #2d9574;">"$url"</span> <span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">]</span>;<span style="color: #4f97d7; font-weight: bold;">then</span>
            <span style="color: #4f97d7; font-weight: bold;">break</span>
        <span style="color: #4f97d7; font-weight: bold;">fi</span>
        view_page_handler $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">url</span><span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">done</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
这里要注意的是，为了防止发生死锁，从管道中读取URL时设置了超时，当出现超时就意味着生产进程赶不上消费进程的消费速度,因此消费进程休眠一秒后再次检查队列中的URL
</p>
</div>
</div>
